/******************************************************************************

                  版权所有 (C), 2008-2012, 上海寰创通信科技有限公司

 ******************************************************************************
  文 件 名   : ac_probe_if.h
  版 本 号   : 初稿
  作    者   : wubin
  生成日期   : 2012年4月25日 星期三
  最近修改   :
  功能描述   : ac_probe_if.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2012年4月25日 星期三
    作    者   : wubin
    修改内容   : 创建文件

******************************************************************************/
#ifndef __AC_PROBE_IF_H__
#define __AC_PROBE_IF_H__


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */
/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/



extern VOID ac_probe_msg_gettables(UINT32 ulMsgLen, VOID *pvMsg);
extern VOID ac_probe_msg_gettuples(UINT32 ulMsgLen, VOID *pvMsg);
extern VOID ac_probe_msg_accessrecord(UINT32 ulMsgLen, VOID *pvMsg);
extern VOID ac_probe_msg_savedata(UINT32 ulMsgLen, VOID *pvMsg);
extern VOID ac_probe_msg_notify(UINT32 ulMsgLen, VOID *pvMsg);
extern VOID ac_probe_msg_loaddata(UINT32 ulMsgLen, VOID *pvMsg);
extern VOID ac_probe_msg_getindex(UINT32 ulMsgLen, VOID *pvMsg);


#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __AC_PROBE_IF_H__ */
