/******************************************************************************
模块名      : SYSCTL
文件名      : OssSysCtl.h
相关文件    :
实现功能    : 系统控制
修改记录    :
------------------------------------------------------------------------------
日期        修改人      修改内容
2008/06/03  李贤平      创建
******************************************************************************/

#ifndef _OSSSYSCTL_H_
#define _OSSSYSCTL_H_

#include "OssSysPoweron.h"
#include "OssSysConnect.h"
#include "OssSysLog.h"
#include "OssSysIpAddr.h"

#endif
