/******************************************************************************
* COPYRIGHT GBCOM
*******************************************************************************
* 功    能:  射频资源管理模块/定时器管理头文件
* 修改历史: 
* 2009-3-22     叶恩云            新建
*
******************************************************************************/

/******************************** 头文件保护开头 *****************************/
#ifndef  __RRM_TIMER_H
#define  __RRM_TIMER_H

#ifdef __cplusplus
extern "C" {
#endif


/******************************** 宏定义 *************************************/
#define RRM_ALL_CTX (void *) -1

/******************************** 结构体定义 *********************************/

/******************************** 全局变量声明 ********************************/

/******************************** 外部函数原形声明 ****************************/
int rrm_timer_init(VOID) ;
int rrm_timer_deinit(VOID) ;
int rrm_timer_register(unsigned int secs, unsigned int usecs,
			   void (*handler)(void *, void *),
			   void *rrm_data, void *user_data) ;
int rrm_timer_cancel(void (* handler)(void *, void *), 
			 void * rrm_data, void * user_data) ;


/********************************** 函数原形声明 ******************************/


#ifdef __cplusplus
}
#endif

#endif /* __RRM_TIMER_H */
/******************************* 头文件结束 **********************************/
