/******************************************************************************
* COPYRIGHT GBCOM
*******************************************************************************
* 功    能:  射频资源管理模块/事件管理头文件
* 修改历史: 
* 2009-3-22     叶恩云            新建
*
******************************************************************************/

/******************************** 头文件保护开头 *****************************/
#ifndef  __RRM_EVENT_H
#define  __RRM_EVENT_H

#ifdef __cplusplus
extern "C" {
#endif


/******************************** 宏定义 *************************************/

/******************************** 结构体定义 *********************************/

/******************************** 全局变量声明 ********************************/

/******************************** 外部函数原形声明 ****************************/
int rrm_event_init(VOID) ;
int rrm_event_deinit(VOID) ;
int rrm_event_register(UINT16 event, int (* event_trigger)(WORD16, BYTE *, WORD16 , BYTE *, WORD16 , BYTE *)) ;
int rrm_event_unregister(UINT16 usEvent) ;
int rrm_event_trigger(WORD16 wEvent, BYTE *pbyBody, WORD16 wLen, BYTE *pbyResv, WORD16 wResv, BYTE *pbyProcData) ;


/********************************** 函数原形声明 ******************************/


#ifdef __cplusplus
}
#endif

#endif /* __RRM_EVENT_H */
/******************************* 头文件结束 **********************************/
